app/User.php

select * from `meetings` where `disabled` = 0 and `creator_id` = 1019 limit 1
---
    public function hasMeeting()
    {
        return Meeting::where('disabled', false)
            ->where('creator_id', $this->id)
            ->first();

select * from `follows` where `user_id` = 1019 and `status` = 'accepted'
---
    public function followers()
    {
        return Follow::where('user_id', $this->id)->where('status', Follow::$accepted)->get();

select * from `follows` where `follower` = 1031 and `status` = 'accepted'
---
    public function following()
    {
        return Follow::where('follower', $this->id)->where('status', Follow::$accepted)->get();

select sum(`amount`) as aggregate from `accounting` where `user_id` = 1019 and `type_account` = 'income' and `type` = 'addiction' and `system` = 0 and `tax` = 0
select sum(`amount`) as aggregate from `accounting` where `user_id` = 1019 and `type_account` = 'income' and `type` = 'deduction' and `system` = 0 and `tax` = 0
---
    public function getPayout()
    {
        $credit = Accounting::where('user_id', $this->id)
            ->where('type_account', Accounting::$income)
            ->where('type', Accounting::$addiction)
            ->where('system', false)
            ->where('tax', false)
            ->sum('amount');

        $debit = Accounting::where('user_id', $this->id)
            ->where('type_account', Accounting::$income)
            ->where('type', Accounting::$deduction)
            ->where('system', false)
            ->where('tax', false)
            ->sum('amount');

select sum(`amount`) as aggregate from `accounting` where `user_id` = 1019 and `type` = 'addiction' and `system` = 0 and `tax` = 0
select sum(`amount`) as aggregate from `accounting` where `user_id` = 1019 and `type` = 'deduction' and `system` = 0 and `tax` = 0
---
    public function getAccountingBalance()
    {
        $additions = Accounting::where('user_id', $this->id)
            ->where('type', Accounting::$addiction)
            ->where('system', false)
            ->where('tax', false)
            ->sum('amount');

        $deductions = Accounting::where('user_id', $this->id)
            ->where('type', Accounting::$deduction)
            ->where('system', false)
            ->where('tax', false)
            ->sum('amount');

select count(*) as aggregate from `sales` where `webinar_id` in (2008, 2009)
---
    public function salesCount()
    {
        $webinarIds = $this->webinars()->pluck('id')->toArray();

        return Sale::whereIn('webinar_id', $webinarIds)->count();

select * from `notifications` where ((`user_id` = 1048 and `type` = 'single') or (`user_id` is null and `group_id` is null and `type` = 'all_users')) and not exists (select * from `notifications_status` where `notifications`.`id` = `notifications_status`.`notification_id`) order by `created_at` desc
---
    public function getUnReadNotifications()
    {
        $notifications = Notification::where(function ($query) {
            $query->where(function ($query) {
                $query->where('user_id', $this->id)
                    ->where('type', 'single');
            })->orWhere(function ($query) {
                if (!$this->isAdmin()) {
                    $query->whereNull('user_id')
                        ->whereNull('group_id')
                        ->where('type', 'all_users');
                }
            });
        })->doesntHave('notificationStatus')
            ->orderBy('created_at', 'desc')
            ->get();

select * from `notifications` where `user_id` is null and `group_id` is null and `type` = 'students' and not exists (select * from `notifications_status` where `notifications`.`id` = `notifications_status`.`notification_id`) order by `created_at` desc
---
        }

        if ($this->isUser()) {
            $studentsNotifications = Notification::whereNull('user_id')
                ->whereNull('group_id')
                ->where('type', 'students')
                ->doesntHave('notificationStatus')
                ->orderBy('created_at', 'desc')
                ->get();

select * from `notifications` where `user_id` is null and `group_id` is null and `type` = 'organizations' and not exists (select * from `notifications_status` where `notifications`.`id` = `notifications_status`.`notification_id`) order by `created_at` desc
---
        }

        if ($this->isOrganization()) {
            $organNotifications = Notification::whereNull('user_id')
                ->whereNull('group_id')
                ->where('type', 'organizations')
                ->doesntHave('notificationStatus')
                ->orderBy('created_at', 'desc')
                ->get();

select * from `sales` where `buyer_id` = 1031 and `webinar_id` is not null and `type` = 'webinar' and `refund_at` is null
---
    public function getPurchasedCoursesIds()
    {
        $webinarIds = [];

        $sales = Sale::where('buyer_id', $this->id)
            ->whereNotNull('webinar_id')
            ->where('type', 'webinar')
            ->whereNull('refund_at')
            ->get();