app/Http/Controllers/Panel/CertificateController.php

    public function achievements(Request $request)
    {
        $user = auth()->user();

        $results = QuizzesResult::where('user_id', $user->id);

        $failedQuizzes = deepClone($results)->where('status', QuizzesResult::$failed)->count();
        $avgGrades = deepClone($results)->where('status', QuizzesResult::$passed)->avg('user_grade');

        if (!empty($request->get('grade'))) {
            $results->where('user_grade', $request->get('grade'));
        }

        $quizzesIds = $results->where('status', QuizzesResult::$passed)
            ->pluck('quiz_id')
            ->toArray();
        $quizzesIds = array_unique($quizzesIds);

        $query = Quiz::whereIn('id', $quizzesIds)
            ->where('status', Quiz::ACTIVE);

        $certificatesCount = deepClone($query)->count();

        $userAllQuizzes = deepClone($query)->get();

        $query = $this->quizFilters(deepClone($query), $request);

        $quizzes = $query->with([
            'webinar',
            'quizResults' => function ($query) {
                $query->where('user_id', auth()->user()->id)
                ->orderBy('id', 'desc');
            },
        ])->paginate(10);
---
select count(*) as aggregate from `quizzes_results` where `user_id` = 1048 and `status` = 'failed'
select avg(`user_grade`) as aggregate from `quizzes_results` where `user_id` = 1048 and `status` = 'passed'
select `quiz_id` from `quizzes_results` where `user_id` = 1048 and `status` = 'passed'
select * from `webinars` where `webinars`.`id` in (2009)

        }

        $webinarsIds = $user->getPurchasedCoursesIds();
        $userWebinars = Webinar::select('id')
            ->whereIn('id', $webinarsIds)
            ->where('status', 'active')
            ->get();
---
select `id` from `webinars` where `id` in (2009) and `status` = 'active'

    private function saveCertificate($user, $makeCertificate)
    {
        $quiz = $makeCertificate['quiz'];
        $quizResult = $makeCertificate['quizResult'];
        $img = $makeCertificate['img'];

        if (!empty($img)) {
            $path = public_path("store/$user->id/certificates");

            if (!is_dir($path)) {
                File::makeDirectory($path, 0777, true);
            }

            $file_path = $path . '/' . $quiz->webinar->title . '(' . $quiz->name . ').jpg';
            if (is_file($file_path)) {
                $file_path = $path . '/' . $quiz->webinar->title . '(' . $quiz->name . '-' . $quizResult->user_grade . ').jpg';
            }

            $img->save($file_path);

            $file_path = '/store/' . $user->id . '/certificates/'. $quiz->webinar->title . '(' . $quiz->name . ').jpg';

            $certificate = Certificate::where('quiz_id', $quiz->id)
                ->where('student_id', $user->id)
                ->where('quiz_result_id', $quizResult->id)
                ->first();
---
select * from `certificates` where `quiz_id` = 36 and `student_id` = 1048 and `quiz_result_id` = 62 limit 1

            ];

            if (!empty($certificate)) {
                $certificate->update($data);
---
update `certificates` set `user_grade` = 100, `file` = '/store/1048/certificates/test().jpg', `created_at` = 1641282932 where `id` = 9

    private function makeCertificate($quizResultId)
    {
        $user = auth()->user();

        $quizResult = QuizzesResult::where('id', $quizResultId)
            ->where('user_id', $user->id)
            ->where('status', QuizzesResult::$passed)
            ->with(['quiz' => function ($query) {
                $query->with(['webinar']);
            }])
            ->first();

        if (!empty($quizResult) and !empty($quizResult->quiz)) {
            $certificateTemplate = CertificateTemplate::where('status', 'publish')->first();

            if (!empty($certificateTemplate)) {
                $quiz = $quizResult->quiz;

                $certificate = Certificate::where('quiz_id', $quiz->id)
                    ->where('student_id', $user->id)
                    ->where('quiz_result_id', $quizResult->id)
                    ->first();
---
select * from `quizzes_results` where `id` = '62' and `user_id` = 1048 and `status` = 'passed' limit 1
select * from `webinars` where `webinars`.`id` in (2009)
select * from `certificates` where `quiz_id` = 36 and `student_id` = 1048 and `quiz_result_id` = 62 limit 1