app/Http/Controllers/Panel/QuizController.php

    public function start(Request $request, $id)
    {
        $quiz = Quiz::where('id', $id)
            ->with([
                'quizQuestions' => function ($query) {
                    $query->with('quizzesQuestionsAnswers');
                },
            ])
            ->first();

        $user = auth()->user();

        if ($quiz) {
            $userQuizDone = QuizzesResult::where('quiz_id', $quiz->id)
                ->where('user_id', $user->id)
                ->get();
---
select * from `quizzes_questions_answers` where `quizzes_questions_answers`.`question_id` in (96)
select * from `quizzes_results` where `quiz_id` = 36 and `user_id` = 1048

    public function quizzesStoreResult(Request $request, $id)
    {
        $user = auth()->user();
        $quiz = Quiz::where('id', $id)->first();

        if ($quiz) {
            $results = $request->get('question');
            $quizResultId = $request->get('quiz_result_id');

            if (!empty($quizResultId)) {

                $quizResult = QuizzesResult::where('id', $quizResultId)
                    ->where('user_id', $user->id)
                    ->first();

                if (!empty($quizResult)) {

                    $passMark = $quiz->pass_mark;
                    $totalMark = 0;
                    $status = '';

                    if (!empty($results)) {
                        foreach ($results as $questionId => $result) {

                            if (!is_array($result)) {
                                unset($results[$questionId]);

                            } else {

                                $question = QuizzesQuestion::where('id', $questionId)
                                    ->where('quiz_id', $quiz->id)
                                    ->first();

                                if ($question and !empty($result['answer'])) {
                                    $answer = QuizzesQuestionsAnswer::where('id', $result['answer'])
                                        ->where('question_id', $question->id)
                                        ->where('creator_id', $quiz->creator_id)
                                        ->first();
---
select * from `quizzes_results` where `id` = '62' and `user_id` = 1048 limit 1
select * from `quizzes_questions` where `id` = 96 and `quiz_id` = 36 limit 1
select * from `quizzes_questions_answers` where `id` = '266' and `question_id` = 96 and `creator_id` = 1019 limit 1

    public function status($quizResultId)
    {
        $user = auth()->user();

        $quizResult = QuizzesResult::where('id', $quizResultId)
            ->where('user_id', $user->id)
            ->with(['quiz' => function ($query) {
                $query->with(['quizQuestions']);
            }])
            ->first();

        if ($quizResult) {
            $quiz = $quizResult->quiz;
            $attemptCount = $quiz->attempt;

            $userQuizDone = QuizzesResult::where('quiz_id', $quiz->id)
                ->where('user_id', $user->id)
                ->count();
---
select * from `quizzes_results` where `id` = '60' and `user_id` = 1048 limit 1
select count(*) as aggregate from `quizzes_results` where `quiz_id` = 36 and `user_id` = 1048

    public function myResults(Request $request)
    {
        $query = QuizzesResult::where('user_id', auth()->user()->id);

        $quizResultsCount = deepClone($query)->count();
        $passedCount = deepClone($query)->where('status', \App\Models\QuizzesResult::$passed)->count();
        $failedCount = deepClone($query)->where('status', \App\Models\QuizzesResult::$failed)->count();
        $waitingCount = deepClone($query)->where('status', \App\Models\QuizzesResult::$waiting)->count();

        $query = $this->resultFilters($request, deepClone($query));

        $quizResults = $query->with([
            'quiz' => function ($query) {
                $query->with(['quizQuestions', 'creator', 'webinar']);
            }
        ])->orderBy('created_at', 'desc')
            ->paginate(10);
---
select count(*) as aggregate from `quizzes_results` where `user_id` = 1048
select count(*) as aggregate from `quizzes_results` where `user_id` = 1048 and `status` = 'passed'
select count(*) as aggregate from `quizzes_results` where `user_id` = 1048 and `status` = 'failed'
select count(*) as aggregate from `quizzes_results` where `user_id` = 1048 and `status` = 'waiting'
select * from `quizzes_results` where `user_id` = 1048 order by `created_at` desc limit 10 offset 0
select * from `users` where `users`.`id` in (1019)
select * from `webinars` where `webinars`.`id` in (2009)