app/Http/Controllers/Panel/UserController.php

select * from `categories` where `parent_id` is null
---
    public function setting($step = 1)
    {
        $user = auth()->user();
        $categories = Category::where('parent_id', null)
            ->with('subCategories')
            ->get();