app/Models/Webinar.php

    public function checkUserHasBought($user = null)
    {
        $hasBought = false;

        if (empty($user) and auth()->check()) {
            $user = auth()->user();
        }

        if (!empty($user)) {
            $sale = Sale::where('buyer_id', $user->id)
                ->where('webinar_id', $this->id)
                ->where('type', 'webinar')
                ->whereNull('refund_at')
                ->first();
---
select * from `sales` where `buyer_id` = 1048 and `webinar_id` = 2009 and `type` = 'webinar' and `refund_at` is null limit 1

            $passed = 0;

            foreach ($files as $file) {
                $status = CourseLearning::where('user_id', $user_id)
                    ->where('file_id', $file->id)
                    ->first();
---
select * from `course_learning` where `user_id` = 1048 and `file_id` = 65 limit 1

    public function activeSpecialOffer()
    {
        $activeSpecialOffer = SpecialOffer::where('webinar_id', $this->id)
            ->where('status', SpecialOffer::$active)
            ->where('from_date', '<', time())
            ->where('to_date', '>', time())
            ->first();
---
select * from `special_offers` where `webinar_id` = 2009 and `status` = 'active' and `from_date` < 1641282905 and `to_date` > 1641282905 limit 1